{
    "v7+ Promo": {
        "videoSrcLink": "https://www.youtube.com/embed/6wAlGCfU34k",
        "description": "📹 এই ভিডিওটি Creative Commons লাইসেন্সের অধীনে আপলোড করা হয়েছে। ✨ তাই যে কেউ চাইলে ডাউনলোড করে 🔄 রি-আপলোড করতে পারবেন। "},

    "v1 Promo": {
        "videoSrcLink": "https://www.youtube.com/embed/zbtELYJaAJU",
        "description": "Introducing the ultimate solution for effortless Bangla and English typing."
    },
    
    "Continuous Word Prediction": {
        "videoSrcLink": "https://www.youtube.com/embed/kdF0NgkRBmo?start=264",
        "description": "While typing, Kontho will continuously try to guess the word you want, even for misspelled words. If you are using the Pro version, suggestions will come from the Google Recommendation API. Most of the time, you wont need to type the whole word just select it from the suggestion window to complete it."
    },
    "Advanced Spellchecker": {
        "videoSrcLink": "https://www.youtube.com/embed/kdF0NgkRBmo?start=160",
        "description": "You can add context to receive specific spelling recommendations from Google suggestions, Gemini AI, and the Google Transliteration API. This helps you get more accurate word suggestions. So even if the word is not saved in your offline dictionary, you can still get suggestions. This means that you do not have to search Google every time you want to check the spelling of a word or name."
    },
	"Next word prediction": {
        "videoSrcLink": "https://www.youtube.com/embed/kdF0NgkRBmo?start=233",
        "description": "Leveraging Google's advanced algorithms to predict the next word as you type. This feature helps you write faster by suggesting the most likely words based on context, saving you time and effort. Context aware word suggestion, reduce the need to type out every word manually."
    },
    "Word Customization": {
        "videoSrcLink": "https://www.youtube.com/embed/kdF0NgkRBmo?start=810",
        "description": "Adding or customizing a word in the offline dictionary is literally just a matter of 3 clicks. Each word can have up to 4 different keywords, allowing you to type the word using any phonetic variation you prefer. Not only can you save words, but you can also store special characters, making the use of special characters much easier."
    },
	"Special Words": {
        "videoSrcLink": "https://www.youtube.com/embed/kdF0NgkRBmo?start=1782",
        "description": "In addition to regular words, you can save special entries like email addresses, phone numbers, and web URLs. After saving, just type a small part of the text, and Kontho will suggest the full entry, allowing you to easily complete it. This way, you don't need to remember the entire text or worry about copying and pasting."
    },

    "Adaptive Dictionary": {
        "videoSrcLink": "https://www.youtube.com/embed/6wAlGCfU34k?start=275",
        "description": "কণ্ঠ ব্যবহার করে যতো লিখবেন এটা ততো আপনার টাইপিং প্যাটার্ন সম্পর্কে জানবে এবং সে অনুযায়ী ওয়ার্ড সাজেষ্ট করবে। অর্থাৎ অপ্রয়োজনীয় শব্দের তুলনায় প্রয়োজনীয় শব্দ আগে সাজেষ্ট করে। এতে করে মাত্র কয়েকটা ক্যারেক্টার টাইপ করেই ওয়ার্ড সাজেশন উইন্ডো থেকে ওয়ার্ড কমপ্লিট করে নেওয়া যায়।"
    },
	
	"Speech to Text (Voice typing)": {
        "videoSrcLink": "https://www.youtube.com/embed/kdF0NgkRBmo?start=1380",
        "description": "With Kontho, you can use voice typing in any application. Switching between English and Bangla is just one click away. You can also set the encoder for the voice typing output, eliminating the need to convert your text after each voice typing session. Unlike Google Voice Typing, the output text from Kontho's Speech to Text feature doesn't break when using popular Bangla fonts."
    },
    "Gemini Ai": {
        "videoSrcLink": "https://www.youtube.com/embed/kdF0NgkRBmo?start=1036",
        "description": "You can use Gemini AI to format selected text in Kontho. The application allows you to add your own prompts or fine-tune existing ones. Additionally, it offers a variety of word suggestions for more precise writing."
    },
	"How to add Gemini API key?": {
        "videoSrcLink": "https://www.youtube.com/embed/XHmYZkKCLOA",
        "description": "To get suggestions or generate text using Gemini AI, you first need to add your Gemini API key in Kontho, which you can obtain for free."
    },
	"Abbreviation:": {
        "videoSrcLink": "https://www.youtube.com/embed/kdF0NgkRBmo?start=1883",
        "description": "Save lengthy text using an easily memorable keyword. Later, when you need the text, simply type the keyword and press space to complete the entire text. This way, you won't have to remember where you saved it or deal with the hassle of copy-pasting."
    },
	"Encoder Options:": {
        "videoSrcLink": "https://www.youtube.com/embed/kdF0NgkRBmo?start=530",
        "description": "While Avro only supports the ANSI 1 encoder, and Bijoy's output is ANSI 2, Kontho gives you the flexibility to choose any encoder you like or even create your own. This applies not just for Bangla, but for English as well"
    },
	"Custom Layout Builder:": {
        "videoSrcLink": "https://www.youtube.com/embed/kdF0NgkRBmo?start=1883",
        "description": "Unlike Avro, Kontho allows you to build advanced layouts like Phonetic and customize each of the default layouts. You have the flexibility to decide what output each key should produce."
    },
    "Customizable OSK": {
        "videoSrcLink": "https://www.youtube.com/embed/6wAlGCfU34k?start=403",
        "description": "On screen keyboard"
    }
}